src/Catalogs/РА_ПодсистемаРасчетаБонусовПартнеров_БонусныеПрограммы/РА_ПодсистемаРасчетаБонусовПартнеров_БонусныеПрограммы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РА_ПодсистемаРасчетаБонусовПартнеров_БонусныеПрограммы</name>
  <owners>Catalog.ДоговорыКонтрагентов</owners>
  <owners>Catalog.Партнеры</owners>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДосрочногоЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриложенияКДоговору</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПриложенияКДоговору</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодДействия</name>
    <type>
      <types>CatalogRef.РА_ПодсистемаРасчетаБонусовПартнеров_ПериодыДействияБонуса</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательПлана</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентПремииЗаПланЗакупок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентПремииЗаПредоплату</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентПремииЗаСложныйПродукт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентПремииЗаСтатистическиеДанныеДанные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентПремииЗаШоуРум</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПоказателяПлана</name>
    <type>
      <types>EnumRef.РА_ТипыПоказателяПлана</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Производители</name>
    <attributes>
      <name>Производитель</name>
      <type>
        <types>CatalogRef.Производители</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительнаяНоменклатура</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиПремийПоФорматамОтгрузки</name>
    <attributes>
      <name>ФорматОтгрузки</name>
      <type>
        <types>CatalogRef.РА_ПодсистемаРасчетаБонусовПартнеров_ФорматыОтгрузки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиПремийПоВидамОборудования</name>
    <attributes>
      <name>ВидОборудования</name>
      <type>
        <types>CatalogRef.РА_ПодсистемаРасчетаБонусовПартнеров_ВидыОборудованияДляНачисленияБонусов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПоказателя</name>
      <type>
        <types>EnumRef.РА_ТипыПоказателяПоВидамОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/РА_ПодсистемаРасчетаБонусовПартнеров_БонусныеПрограммы/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
			
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РА_ПодсистемаРасчетаБонусовПартнеров_БонусныеПрограммы.Ссылка
	|ИЗ
	|	Справочник.РА_ПодсистемаРасчетаБонусовПартнеров_БонусныеПрограммы КАК
	|		РА_ПодсистемаРасчетаБонусовПартнеров_БонусныеПрограммы
	|ГДЕ
	|	РА_ПодсистемаРасчетаБонусовПартнеров_БонусныеПрограммы.Владелец = &Владелец
	|	И РА_ПодсистемаРасчетаБонусовПартнеров_БонусныеПрограммы.Валюта = &Валюта
	|	И РА_ПодсистемаРасчетаБонусовПартнеров_БонусныеПрограммы.ПериодДействия = &ПериодДействия
	|	И РА_ПодсистемаРасчетаБонусовПартнеров_БонусныеПрограммы.ТипПоказателяПлана = &ТипПоказателяПлана
	|	И РА_ПодсистемаРасчетаБонусовПартнеров_БонусныеПрограммы.Ссылка <> &Ссылка
	|	И НЕ РА_ПодсистемаРасчетаБонусовПартнеров_БонусныеПрограммы.ПометкаУдаления";

	Запрос.УстановитьПараметр("ПериодДействия", ПериодДействия);
	Запрос.УстановитьПараметр("Валюта", Валюта);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ТипПоказателяПлана", ТипПоказателяПлана);
	Запрос.УстановитьПараметр("Владелец", Владелец);

	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда

		ОбщегоНазначения.СообщитьПользователю(
			"Бонусная программа с такими настройками уже существует! Запись невозможна!", , , , Отказ);

	КонецЕсли;
	
	Если ТипЗнч(Владелец) = Тип("СправочникСсылка.Партнеры") Тогда

		Партнер = Владелец;

	ИначеЕсли ТипЗнч(Владелец) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда

		Партнер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Владелец, "Партнер");

	КонецЕсли;
	
	Если ЭтоНовый() И Не ЗначениеЗаполнено(Наименование) Тогда

		Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1, %2",
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Владелец, "Наименование"),
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПериодДействия, "Наименование"));

	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#КонецЕсли
